// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

let number = prompt('Введіть число');
number = Number(number);
    if (number === 10) {
        alert('Вірно');
    }
    else {
        alert('Невірно');
    }
console.log(number);


// let isAdult = confirm('Вам є 18 років?');
// console.log(isAdult);
